# 内存模型

## 查看对象内存布局

## g++

网上大多数文章使用的是`g++ -fdump-class-hierarchy vptr.cpp`生成输出文件，通过文件查看内存布局。但是由于`g++`的版本问题，在`8`之后该选项已经失效，改用`g++ -fdump-lang-class vptr.cpp`才能正确生成输出文件。
输出文件是一个包含几多信息的文件，可以在文件中通过类名定位到要查看的类。

导出的布局图示在`data.cpp`同一目录下的一个`.class`文件中

如`data.cpp.002t.class`,内容示例：

```text
VTT for A
A::_ZTT1A: 4u entries
0 ((& A::_ZTV1A) + 24u)
8 ((& A::_ZTC1A0_1Y) + 24u)
16 ((& A::_ZTC1A8_1Z) + 24u)
24 ((& A::_ZTV1A) + 48u)

Class A
size=16 align=8
base size=16 base align=8
A (0x0x7f9dbc60c540) 0
vptridx=0u vptr=((& A::_ZTV1A) + 24u)
Y (0x0x7f9dbc5c11a0) 0 nearly-empty
primary-for A (0x0x7f9dbc60c540)
subvttidx=8u
X (0x0x7f9dbc5ccae0) 0 empty virtual
vbaseoffset=-24
Z (0x0x7f9dbc5c1208) 8 nearly-empty
subvttidx=16u vptridx=24u vptr=((& A::_ZTV1A) + 48u)
X (0x0x7f9dbc5ccae0) alternative-path
```

## clang

```shell
clang -Xclang -fdump-record-layouts data.cpp
```

要求`data.cpp`中有对相关类做`sizeof`求值的语句，输出在`stdout`，类似

```text
*** Dumping AST Record Layout
0 | class A
0 | class Y (primary base)
0 | (Y vtable pointer)
8 | class Z (base)
8 | (Z vtable pointer)
0 | class X (virtual base) (empty)
| [sizeof=16, dsize=16, align=8
| nvsize=16, nvalign=8]
```

## VS

添加编译选项

/d1reportSingleClassLayout<类名> ：输出单个类相关布局

或

/d1reportAllClassLayout： 输出所有类相关布局

## 单继承关系的对象模型

基类是Base, 子类是Deliver。代码如下：

```cpp
#include <cstdio>

class Base {
 public:
  virtual ~Base() {}
  virtual void Test() { printf("Base::Test\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class Derive : public Base {
 public:
  virtual ~Derive() {}
  virtual void Test() override { printf("Derive::Test\n"); }
  virtual void Print() { printf("Derive::Print\n"); }

 private:
  int c_ = 0;
};

int main() {
  Base base;
  Derive derive;

  printf("sizeof(Base) = %zu\n", sizeof(Base));
  printf("sizeof(Derive) = %zu\n", sizeof(Derive));

  return 0;
}
/*
sizeof(Base) = 16
sizeof(Derive) = 24
*/
```

`Base`和`Derive`的内存模型如下

```text
*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int a_
        12 |   int b_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derive
         0 |   class Base (primary base)
         0 |     (Base vtable pointer)
         8 |     int a_
        12 |     int b_
        16 |   int c_
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=20, nvalign=8]
```

单继承关系对象的模型有以下几个特点：

- 存储普通成员变量（基类的成员在前，子类新增的成员在后）
- 如果有虚函数，会存储一个虚指针（无论有多少个虚函数，都只会有一个虚指针）（非虚继承的情况下是这样，虚继承后续会讲）
- 虚指针指向虚表（存放虚函数指针的表格）
- 继承父类的虚表，并在此基础上进行修改
- 子类的虚函数与父类虚函数重复时，就将子类的虚函数指针覆盖虚表中对应项
- 子类新的虚函数在虚表上新增一项

## 多继承下的内存模型

```cpp
#include <cstdio>

class BaseA {
 public:
  virtual ~BaseA() {}
  virtual void TestA() { printf("BaseA::TestA\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class BaseB {
 public:
  virtual ~BaseB() {}
  virtual void TestB() { printf("BaseB::TestB\n"); }

 private:
  int c_ = 0;
};

class Derive : public BaseA, public BaseB {
 public:
  virtual ~Derive() {}
  virtual void TestA() override { printf("Derive::TestA\n"); }
  virtual void TestB() override { printf("Derive::TestB\n"); }
  virtual void Print() { printf("Derive::Print\n"); }

 private:
  int d_ = 0;
};

int main() {
  BaseA base_a;
  BaseB base_b;
  Derive derive;

  printf("sizeof(BaseA) = %zu\n", sizeof(BaseA));
  printf("sizeof(BaseB) = %zu\n", sizeof(BaseB));
  printf("sizeof(Derive) = %zu\n", sizeof(Derive));

  return 0;
}
/*
sizeof(BaseA) = 16
sizeof(BaseB) = 16
sizeof(Derive) = 32
*/
```

### 子类内存模型构造过程

同样，先按照父类的方式构造内存空间，两个父类，按照继承的顺序，从左至右：

- 按照`BaseA`的方式构造内存空间

```text
*** Dumping AST Record Layout
         0 | class BaseA
         0 |   (BaseA vtable pointer)
         8 |   int a_
        12 |   int b_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]
```

- 按照`BaseB`的方式构造内存空间

```text
*** Dumping AST Record Layout
         0 | class BaseB
         0 |   (BaseB vtable pointer)
         8 |   int c_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]
```

- 基于之前的内存空间再构建属于`Derive`独有的成员

```text
*** Dumping AST Record Layout
         0 | class Derive
         0 |   class BaseA (primary base)
         0 |     (BaseA vtable pointer)
         8 |     int a_
        12 |     int b_
        16 |   class BaseB (base)
        16 |     (BaseB vtable pointer)
        24 |     int c_
        28 |   int d_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]
```

- 在第一张虚表中，使用`Derive::TestA`虚函数的指针覆盖`BaseA::TestA`虚函数的指针
- 在第二张虚表中，使用`Derive::TestB`虚函数的指针覆盖`BaseB::TestB`虚函数的指针
- 在第一张虚表中，新增`Derive::Print`虚函数

菱形继承时，空间布局类似，只是最终的派生类中会保存两份顶层基类的数据成员，导致空间浪费，也会在使用时造成歧义

### 例子2：基类BaseA不包含虚函数和基类BaseB包含虚函数

```cpp
#include <cstdio>

class BaseA {
 public:
  void TestA() { printf("BaseA::TestA\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class BaseB {
 public:
  virtual ~BaseB() {}
  virtual void TestB() { printf("BaseB::TestB\n"); }

 private:
  int c_ = 0;
};

class Derive : public BaseA, public BaseB {
 public:
  virtual ~Derive() {}
  virtual void TestB() override { printf("Derive::TestB\n"); }
  virtual void Print() { printf("Derive::Print\n"); }

 private:
  int d_ = 0;
};

int main() {
  BaseA base_a;
  BaseB base_b;
  Derive derive;

  printf("sizeof(BaseA) = %zu\n", sizeof(BaseA));
  printf("sizeof(BaseB) = %zu\n", sizeof(BaseB));
  printf("sizeof(Derive) = %zu\n", sizeof(Derive));

  return 0;
}
/*
sizeof(BaseA) = 8
sizeof(BaseB) = 16
sizeof(Derive) = 24
*/
```

内存布局如下，选择将第一个包含虚函数的类作为主基类

```text
*** Dumping AST Record Layout
         0 | class BaseA
         0 |   int a_
         4 |   int b_
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class BaseB
         0 |   (BaseB vtable pointer)
         8 |   int c_
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derive
         0 |   class BaseB (primary base)
         0 |     (BaseB vtable pointer)
         8 |     int c_
        12 |   class BaseA (base)
        12 |     int a_
        16 |     int b_
        20 |   int d_
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]
```

## 简单虚继承

```cpp
#include <cstdio>

class Base {
 public:
  void Test() { printf("Base::Test\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class DeriveA : virtual public Base {
 public:
  void Print() { printf("Derive::Print\n"); }

 private:
  int e_ = 0;
};

class DeriveB : virtual public Base {
 public:
  virtual void Print() { printf("Derive::Print\n"); }

 private:
  int e_ = 0;
};

int main() {
  printf("sizeof(Base) = %zu\n", sizeof(Base));
  printf("sizeof(DeriveA) = %zu\n", sizeof(DeriveA));
  printf("sizeof(DeriveB) = %zu\n", sizeof(DeriveB));

  return 0;
}
/*
sizeof(Base) = 8
sizeof(DeriveA) = 24
sizeof(DeriveB) = 24
*/
```

```text
*** Dumping AST Record Layout
         0 | class Base
         0 |   int a_
         4 |   int b_
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class DeriveA
         0 |   (DeriveA vtable pointer)
         8 |   int e_
        12 |   class Base (virtual base)
        12 |     int a_
        16 |     int b_
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class DeriveB
         0 |   (DeriveB vtable pointer)
         8 |   int e_
        12 |   class Base (virtual base)
        12 |     int a_
        16 |     int b_
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]
```

```text
DeriveA
  vfptr(virtual function ptr, 虚函数表)
  vbptr(virtual base ptr, 虚基类表)
  e_
Base
  a_
  b_
```

详细介绍：

- vfptr:虚表指针，指向虚函数表
- vbptr:虚基类指针，指向虚基类表
- 每个虚基类表的第一项存放的是虚基类表指针（vbptr）所在地址到该类内存首地址的偏移值
- 每个虚基类表的第二项、第三项存放的是该类的最左虚继承父类、次左虚继承父类...的内存地址相对于虚基类表指针的偏移值
- 和普通继承不同的是，这里不是先按照父类的方式构造内存空间，Base对象的内存空间在最下方。

## 虚继承且没有虚函数

```cpp
#include <cstdio>

class Base {
 public:
  void Test() { printf("Base::Test\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class BaseB : virtual public Base {
 public:
  void TestB() { printf("BaseB::TestB\n"); }

 private:
  int c_ = 0;
};

class BaseC : virtual public Base{
 public:
  void TestC() { printf("BaseC::TestC\n"); }

 private:
  int d_ = 0;
};

class Derive : public BaseB, public BaseC {
 public:
  void Print() { printf("Derive::Print\n"); }

 private:
  int e_ = 0;
};

int main() {
  printf("sizeof(Base) = %zu\n", sizeof(Base));
  printf("sizeof(BaseB) = %zu\n", sizeof(BaseB));
  printf("sizeof(BaseC) = %zu\n", sizeof(BaseC));
  printf("sizeof(Derive) = %zu\n", sizeof(Derive));

  return 0;
}
/*
sizeof(Base) = 8
sizeof(BaseB) = 24
sizeof(BaseC) = 24
sizeof(Derive) = 40
*/
```

```text
*** Dumping AST Record Layout
         0 | class Base
         0 |   int a_
         4 |   int b_
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | class BaseB
         0 |   (BaseB vtable pointer)
         8 |   int c_
        12 |   class Base (virtual base)
        12 |     int a_
        16 |     int b_
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class BaseC
         0 |   (BaseC vtable pointer)
         8 |   int d_
        12 |   class Base (virtual base)
        12 |     int a_
        16 |     int b_
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derive
         0 |   class BaseB (primary base)
         0 |     (BaseB vtable pointer)
         8 |     int c_
        16 |   class BaseC (base)
        16 |     (BaseC vtable pointer)
        24 |     int d_
        28 |   int e_
        32 |   class Base (virtual base)
        32 |     int a_
        36 |     int b_
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=32, nvalign=8]
```

## 虚继承且存在虚函数

```cpp
#include <cstdio>

class Base {
 public:
  virtual ~Base() {}
  virtual void Test() { printf("Base::Test\n"); }

 private:
  int a_ = 0;
  int b_ = 0;
};

class BaseB : virtual public Base {
 public:
  virtual ~BaseB() {}
  virtual void TestB() { printf("BaseB::TestB\n"); }

 private:
  int c_ = 0;
};

class BaseC: virtual public Base {
 public:
  virtual ~BaseC() {}
  virtual void TestC() { printf("BaseC::TestC\n"); }

 private:
  int d_ = 0;
};


class Derive : public BaseB, public BaseC {
 public:
  virtual void Print() { printf("Derive::Print\n"); }

 private:
  int e_ = 0;
};

int main() {
  printf("sizeof(Base) = %zu\n", sizeof(Base));
  printf("sizeof(BaseB) = %zu\n", sizeof(BaseB));
  printf("sizeof(BaseC) = %zu\n", sizeof(BaseC));
  printf("sizeof(Derive) = %zu\n", sizeof(Derive));

  return 0;
}
/*
sizeof(Base) = 16
sizeof(BaseB) = 32
sizeof(BaseC) = 32
sizeof(Derive) = 48
*/
```

```text
*** Dumping AST Record Layout
         0 | class Base
         0 |   (Base vtable pointer)
         8 |   int a_
        12 |   int b_
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class BaseB
         0 |   (BaseB vtable pointer)
         8 |   int c_
        16 |   class Base (virtual base)
        16 |     (Base vtable pointer)
        24 |     int a_
        28 |     int b_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class BaseC
         0 |   (BaseC vtable pointer)
         8 |   int d_
        16 |   class Base (virtual base)
        16 |     (Base vtable pointer)
        24 |     int a_
        28 |     int b_
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class Derive
         0 |   class BaseB (primary base)
         0 |     (BaseB vtable pointer)
         8 |     int c_
        16 |   class BaseC (base)
        16 |     (BaseC vtable pointer)
        24 |     int d_
        28 |   int e_
        32 |   class Base (virtual base)
        32 |     (Base vtable pointer)
        40 |     int a_
        44 |     int b_
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=32, nvalign=8]
```

## 虚拟继承和普通继承的区别

- 在普通继承中，如果继承的子类本身有虚函数，就会在从父类继承过来的虚表上进行扩展；而在虚继承中，如果子类本身有虚函数，编译器就会为其单独生成一个虚表指针（vptr）和虚函数表，如果子类本身没有新增虚函数，那么vptr就不会存在，也不会有对应的虚函数表。
- 普通继承中，是先按父类的方式构造对象，然后在此基础上进行扩展和覆盖；而在虚继承中，不是这样的。
- 虚继承中，父类对象的虚表是单独保存的，通过新增的虚基类指针和虚基类表，来标明各个父类对象内存空间的偏移值。

## 继承情况下的内存布局

在msvc环境下，虚函数和虚继承是分开的。其实非常简单，以下分类讨论。

### 虚函数且非虚继承讨论

- B有虚函数，那么B有一个指针vfptr指向虚函数表，虚函数表里只有两种东西，一个type_info（为了rtti）和所有虚函数的地址。
- D继承B，那么D把B的vfptr和虚函数表也继承，然后修改type_info，D中override的函数也在虚函数表中进行改写。
- 若是多重继承，那么子类会有多个vfptr。假设B1，B2都有虚函数，且为D的父类。那么`B2* b2 = d;`的时候，程序会转化成`B2* b2 = (B2*)((char*)d + sizeof(B1));`所以不用担心找错或者找不到表。

### 虚继承且没有虚函数讨论

- B没有虚函数，D虚继承B，那么D有一个指针vbptr指向一个虚基类表，虚基类表里存放的是虚基类B的初始位置和子类D的vbptr的位置差。
- 若是多重虚继承，即D虚继承B1，B2，那么虚继承表里有多个表项。
- 若是嵌套virtual，即D2虚继承D1，D1虚继承B，那么同样的，D2有一个vbptr指向虚基类表，这个表存储D1的初始位置和D2的vbptr位置差，同时为了防止嵌套层次增多而引起的对B中对象的访问时间的增长，这个表同时也存储B的初始位置和D2的vbptr的位置差。即，这个虚基类表有两个表项。

### 虚继承且由虚函数讨论

- 若虚基类没有虚函数，显然两者不会有交集，各管各的。
- 若虚基类有虚函数。即B中有虚函数f。
  - 那么，D1虚继承B，且D1中没有新的虚函数（即，D1中的所有虚函数都是override虚基类B的），那么D1继承B的vfptr，这时就有一个问题。若D2也虚继承B，还没问题。若D3继承D1和D2，那么D3只有一个vfptr和一个虚函数表。那么若D1和D2都改写了f，那么D3就炸了。D3::f出现了矛盾。所以如果D1和D2都改写了f，D3不能同时继承D1和D2。若D1或D2其中只有1个或0个改写了f，则D3可以继承，而且非常有意思的是，若D1改写了f，`D2* d2 = d3`，那么`d2->f()`调用的是`D1::f`，尽管D1和D2没什么关系。
  - 若D虚继承B，且D中有新的虚函数，那么，有趣的是，D除了有B虚继承来的vfptr之外，还有一个新的，属于D自己的vfptr，即D的对象模型中有两个vfptr。而这两个vfptr分别管理两组虚函数，继承来的B的vfptr管理B中就有的虚函数，而新的vfptr管理新的虚函数。

其实msvc这套实现非常简(xiao)洁(lv)易(di)懂(xia)，比g++两表合一容易理解多了。

## 参考资料

- [多继承下的内存模型](https://zhuanlan.zhihu.com/p/444467440)
- [虚继承中，虚基类在派生类中的内存分布是如何？](https://www.zhihu.com/question/24858417)
